* Present Pareto Front for 176
  All use fb18ch100, fit09c unless otherwise noted
  |  N | Model                                | R_test |     EFOV |       Bits |                 mBits/Extra Parm | Improvement Reason         |
  |----+--------------------------------------+--------+----------+------------+----------------------------------+----------------------------|
  |  5 | log2n_wcg01w_ap0z0_dexp3b            |    266 | 0.070756 | 0.10587063 | (10.587063 - 100 Bits) / (5 - N) |                            |
  |  6 | log2n_wcg01w_ap1z0_dexp3b            |    276 | 0.076176 | 0.11431007 |                         0.843944 | POLE                       |
  |  7 | log2n_wcg01w_ap1z1_dexp3b            |    320 |   0.1024 | 0.15585542 |                         4.154535 | ZERO                       |
  |  8 | log2n_wcg01w_ap2z1_dexp3b            |    338 | 0.114244 | 0.17501876 |                         1.916334 | POLE                       |
  |  9 | log2n_wcg01w_ap2z1_dexp              |    344 | 0.118336 | 0.18169914 |                         0.668038 | NL                         |
  | 10 | log2n_wcg01_ap2z1_dexp               |    357 | 0.127449 | 0.19668864 |                          1.49895 | spectral width             |
  | 11 | lognn_wcg01_ap2z1_dexp               |    365 | 0.133225 | 0.20627055 |                         0.958191 | LOGN                       |
  | 12 | lognn_wcg01_ap3z1_dexp               |    368 | 0.135424 | 0.20993531 |                         0.366476 | POLE                       |
  | 14 | lognn_wcg01_adp1pc_ap2z1_dexp        |    374 | 0.139876 | 0.21738343 |                         0.372406 | trade pole for ADP         |
  | 17 | lognn_wcg02_ap2z1_dexp               |    379 | 0.143641 | 0.22371237 |                       0.21096467 | Add 2nd channel, ditch ADP |
  | 19 | lognn_wcg02_ap3z1_dexp               |    381 | 0.145161 | 0.22627537 |                          0.12815 | add pole                   |
  | 23 | lognn_wcg02_adp1pc_ap2z1_dexp        |    395 | 0.156025 | 0.24472783 |                        0.4613115 | add ADP                    |
  |----+--------------------------------------+--------+----------+------------+----------------------------------+----------------------------|
  | 47 | lognn_wcg02_adp1pcw_fir15_siglog100  |    406 | 0.164836 | 0.25986857 |                      0.063086417 | fit05g/c                   |
  | 48 | lognbzn_wcg02_adp1pc_fir15_siglog100 |    413 | 0.170569 | 0.26980613 |                         0.993756 | fit05h/c                   |
  #+TBLFM: $4=($3/1000)^2::$5=-log(1-$4)/log(2)::$6=100*($5-@-1$5)/($1 - @-1$1)

* Models Needed for Main Paper
** Main Thrust
  1. [X] Classic STRF model (Previous work)
  2. [X] Rank 1-4 simplification
  3. [X] Spectral simplification
  4. [X] Temporal simplification
  5. [X] Nonlinearities can further improve
	 - [X] Depression helps
	 - [X] Voltq helps
	 - [ ] Per-chan NLs help

** Reasons Why
*** Same performance, fewer params: Pareto front
    1. [ ] Shows optimality of models
    2. [ ] Shows combinatoric approach mostly generates suboptimal results

*** Better performance on data-limited sets

*** Applicable to other brain areas, stimuli
    1. [ ] Show that IC neurons are simpler
    2. [ ] Show concept works for non-vocalization data.

** Extra, Optional Supporting Points 
*** Similarity of other cost functions
    1. [ ] Compute log-likelihood for the above models, show similar progression

*** Alternative Filterbanks
    1. [X] Show that FB is better than GT

*** Alternative Nonlinearities 
    1. [ ] Shows lognn Compressor is best
    2. [ ] Shows dexp NL is best for AP, and SIGLOG is best for FIR

*** Alternative Spectral simplifications 
    1. [X] Gaussian differences
    2. [X] Gaussian square root
    3. [X] Morlet

*** Alternative Temporal simplifications:
    1. [X] All the PZ models (Real-valued IIR filters)
    2. [ ] Inverse Gaussian? (no other hypotheses were really tested)

* Minimal Remaining Work
  - Compute the log likelihood
  - Revise Poisson Cost Function. Predicted spike rate P gives 1/P = lambda, the poisson interval. Compute the ISI of the spike train, and using the inverse of CDF(lambda), figure out how likely that spike train is. 
	
* Wish List for SVD
  - Stimuli set that are not just vocalizations
  - A data set with 30 reps for training, 30 for fitting (they can be different)
  - Raw data, unfiltered and before any processing occurs, recorded anywhere? Can you get delta/gamma waves from that? LFPs?
  - Recordings from the Cochlear Nucleus, Superior Olivary, Inferior Colliculus, Medial Geniculate Nucleus, (A1), or Non-A1 cortex? By When?
  - XYZ positional data so I could start connecting best-fit parameters to cortical location
